REPORT.org
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+TITLE: Assignment 2
#+OPTIONS: toc:nil
#+AUTHOR: Yoogottam Khandelwal

* Question 1
** part 1
** part 2
Among DeepWalk, Node2Vec and Struc2Vec, Node2Vec explores the graph in a better manner than DeepWalk but since the graph is very small (8 nodes only), The `q`-related outward DFS walks might have confused the network by including distant nodes in the neighborhood. Since these algorithms create embeddings based on the walk (and not node information in particular), DeepWalk was better than Node2Vec.
** part 3

* Question 2

* Question 3
Question 3 questions are answered in the `README.md` present within the code zip
