REPORT.tex
% Created 2022-03-28 Mon 17:20
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=0.5in]{geometry}
\author{Yoogottam Khandelwal}
\date{\today}
\title{Assignment 2}
\hypersetup{
 pdfauthor={Yoogottam Khandelwal},
 pdftitle={Assignment 2},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Question 1}
\label{sec:org102f1d4}
\subsection{part 1}
\label{sec:orge5eb16b}
\subsection{part 2}
\label{sec:orgc206b7e}
Among DeepWalk, Node2Vec and Struc2Vec, Node2Vec explores the graph in a better manner than DeepWalk but since the graph is very small (8 nodes only), The `q`-related outward DFS walks might have confused the network by including distant nodes in the neighborhood. Since these algorithms create embeddings based on the walk (and not node information in particular), DeepWalk was better than Node2Vec.
\subsection{part 3}
\label{sec:org114a8d4}

\section{Question 2}
\label{sec:org5484b1e}

\section{Question 3}
\label{sec:org70ddbb8}
Question 3 questions are answered in the `README.md` present within the code zip
\end{document}
